{
  "projects": [
    {
      "id": "hmh-platform",
      "title": "HMH Learning Platform",
      "category": "Professional",
      "type": "EdTech Platform",
      "description": "High-performance educational technology platform serving millions of students globally. Architected microfrontend system with reactive backend services, achieving sub-100ms response times under load.",
      "challenge": "Building a scalable, performant platform capable of handling millions of concurrent users while maintaining real-time synchronization across distributed systems. The system needed to support thousands of simultaneous test sessions while maintaining sub-second response times and ensuring data consistency across multiple services.",
      "solution": "Implemented microfrontend architecture with Module Federation for independent deployments, reactive Spring Boot services with WebFlux for non-blocking operations, and optimized Aurora PostgreSQL connection pooling with Hasura to achieve enterprise-grade performance. Established comprehensive monitoring with Datadog and implemented intelligent caching strategies.",
      "impact": [
        "Serves millions of students across K-12 education globally",
        "Sub-100ms P99 latency maintained under peak load of 15,000+ concurrent users",
        "99.9% uptime for critical educational services with zero critical incidents since launch",
        "8,250+ requests per second handled at 50% resource utilization"
      ],
      "technologies": [
        "React",
        "TypeScript",
        "Spring Boot",
        "Hasura",
        "GraphQL",
        "Aurora PostgreSQL",
        "Kubernetes",
        "Webpack",
        "Module Federation",
        "Datadog",
        "WebSockets",
        "Redis"
      ],
      "links": {
        "live": null,
        "github": null,
        "case_study": null
      },
      "featured": true,
      "year": 2024
    },
    {
      "id": "db-optimization",
      "title": "Database Performance Optimization",
      "category": "Professional",
      "type": "Performance Engineering",
      "description": "Resolved critical performance bottlenecks in Aurora PostgreSQL cluster serving high-traffic educational platform. Optimized connection pooling and query patterns to eliminate latency spikes during peak load.",
      "challenge": "Platform experiencing severe latency spikes (7-10+ seconds P95) during peak hours due to connection exhaustion, inefficient query patterns, and database connection pool misconfiguration. This was affecting user experience for thousands of students during critical testing periods.",
      "solution": "Implemented intelligent connection pooling with Hasura (max 50 connections per instance), optimized database indices for frequently accessed queries, restructured query patterns to reduce N+1 problems, and configured proper connection pool settings (acquire timeout: 10s, idle timeout: 180s, max lifetime: 600s). Set up comprehensive monitoring with Datadog to track connection usage and query performance.",
      "impact": [
        "90% reduction in P95 latency - from 7+ seconds to sub-100ms during peak load",
        "Eliminated all connection timeout errors affecting user experience",
        "Reduced database load by 70% through query optimization and caching",
        "Improved user experience for millions of students during critical testing periods"
      ],
      "technologies": [
        "Aurora PostgreSQL",
        "Hasura",
        "Datadog",
        "Gatling",
        "GraphQL",
        "Connection Pooling",
        "SQL Optimization",
        "Performance Testing"
      ],
      "links": {
        "live": null,
        "github": null,
        "case_study": null
      },
      "featured": true,
      "year": 2024
    },
    {
      "id": "build-optimization",
      "title": "Monorepo Build Performance",
      "category": "Professional",
      "type": "Developer Experience",
      "description": "Dramatically improved build performance across massive 600+ package monorepo by migrating from Babel to SWC and optimizing webpack configurations, achieving 65-70% reduction in build times.",
      "challenge": "Development team experiencing extremely slow build times (10-15+ minutes) in massive monorepo with 600+ packages, severely impacting developer productivity and CI/CD pipeline efficiency. Babel transpilation was the primary bottleneck.",
      "solution": "Migrated from Babel to SWC loader for TypeScript transpilation, achieving 20x faster transpilation. Optimized webpack configurations with proper code splitting, implemented persistent caching, and migrated to PNPM for faster package installation. Resolved all symlink loops and circular dependencies affecting build performance.",
      "impact": [
        "65-70% reduction in build times - from 10-15 minutes to 3-5 minutes",
        "Saved hundreds of developer hours monthly across entire engineering team",
        "Improved CI/CD pipeline efficiency with faster feedback loops",
        "Enhanced developer experience with near-instant hot module replacement"
      ],
      "technologies": [
        "SWC",
        "Webpack",
        "PNPM",
        "Babel",
        "TypeScript",
        "Module Federation",
        "Node.js",
        "Monorepo Tools"
      ],
      "links": {
        "live": null,
        "github": null,
        "case_study": null
      },
      "featured": true,
      "year": 2024
    },
    {
      "id": "chrome-extension",
      "title": "API Testing Chrome Extension",
      "category": "Tools",
      "type": "Developer Tool",
      "description": "Chrome extension for intercepting and testing API requests in real-time. Features include request modification, authentication handling, comprehensive response inspection, and request replay functionality for enhanced development workflow.",
      "challenge": "Development team needed efficient way to test and debug API requests without switching between multiple tools or modifying application code. Existing solutions were either too heavyweight or lacked critical features for our specific use case.",
      "solution": "Built Chrome extension using modern Web APIs (webRequest, storage, tabs) for request interception, with intuitive React-based UI for viewing, modifying, and replaying requests in real-time. Implemented persistent storage with IndexedDB for request history and custom authentication header injection.",
      "impact": [
        "Accelerated API debugging workflow by eliminating tool context switching",
        "Reduced development time for API integration testing by 40%",
        "Improved team productivity across multiple development teams",
        "Adopted as standard tool by engineering organization"
      ],
      "technologies": [
        "TypeScript",
        "Chrome Extension APIs",
        "React",
        "Web Request API",
        "IndexedDB",
        "Webpack",
        "Manifest V3"
      ],
      "links": {
        "live": null,
        "github": null,
        "case_study": null
      },
      "featured": true,
      "year": 2024
    },
    {
      "id": "multi-tool",
      "title": "Multi-Tool React Application",
      "category": "Personal",
      "type": "Web Application",
      "description": "Comprehensive collection of 22 lightweight React-based productivity and development tools with beautiful modern design. Features password generation, color testing, unit converters, JSON formatters, and various utilities - all in a single fast-loading application.",
      "challenge": "Creating a unified suite of commonly-used development and productivity tools with minimal dependencies, fast load times, and offline capabilities. Tools needed to work without external API calls for privacy and performance.",
      "solution": "Built modular React application with intelligent code splitting for optimal load times, local storage for persistence and offline functionality, Web Crypto API for secure password generation, and modern design with Tailwind CSS. Each tool is independently loaded to minimize initial bundle size.",
      "impact": [
        "22 professional-grade tools in single fast-loading application (< 2s initial load)",
        "Zero external dependencies for core functionality ensuring privacy",
        "Fully responsive design works seamlessly on mobile and desktop",
        "Growing user base with positive feedback on performance and UX"
      ],
      "technologies": [
        "React",
        "TypeScript",
        "Tailwind CSS",
        "Web Crypto API",
        "Three.js",
        "Vite",
        "Local Storage",
        "PWA"
      ],
      "links": {
        "live": "https://tools.arshadshah.com",
        "github": "https://github.com/arshad-shah/tools",
        "case_study": null
      },
      "featured": true,
      "year": 2024
    },
    {
      "id": "nimaz",
      "title": "Nimaz - Islamic Companion App",
      "category": "Personal",
      "type": "Mobile Application",
      "description": "Comprehensive Islamic companion app for daily Muslim prayers and spiritual needs. Features precise prayer times based on location, accurate Qibla compass, digital Tasbeeh counter, and complete Quran with translations in multiple languages.",
      "challenge": "Building offline-first mobile app with accurate prayer time calculations for any location globally, while maintaining smooth performance and intuitive UX. Prayer times must be precise and work reliably offline with proper background notifications.",
      "solution": "Implemented MVVM architecture with Room Database for offline data persistence, WorkManager for reliable background prayer notifications that work across Android versions, and custom algorithms for highly accurate prayer time calculations based on location coordinates. Used Material Design 3 for modern, accessible UI.",
      "impact": [
        "Thousands of downloads from Google Play Store with growing active user base",
        "4.5+ star rating from users with consistent positive feedback",
        "Reliable offline functionality with accurate prayer times worldwide",
        "Zero crashes in production with 99.9% uptime"
      ],
      "technologies": [
        "Kotlin",
        "Android SDK",
        "Room Database",
        "WorkManager",
        "Material Design 3",
        "Location Services",
        "MVVM Architecture",
        "Coroutines"
      ],
      "links": {
        "live": "https://nimaz.arshadshah.com",
        "github": "https://github.com/arshad-shah/Nimaz",
        "case_study": "https://play.google.com/store/apps/details?id=com.arshadshah.nimaz"
      },
      "featured": true,
      "year": 2023
    },
    {
      "id": "expense-tracker",
      "title": "Expense Tracker",
      "category": "Personal",
      "type": "Web Application",
      "description": "Modern expense tracking application with secure authentication, beautiful data visualization, and intuitive expense categorization. Built with React and Firebase for real-time synchronization across all devices.",
      "challenge": "Creating intuitive expense management tool with real-time sync across devices while maintaining data security and privacy. Users needed ability to track expenses, visualize spending patterns, and manage budgets without complicated setup.",
      "solution": "Leveraged Firebase Authentication for secure user management and Firestore for real-time database with offline support. Implemented Recharts for beautiful, interactive data visualizations showing spending trends, category breakdowns, and monthly comparisons. Used Framer Motion for smooth, delightful user experience.",
      "impact": [
        "Real-time expense synchronization across all user devices",
        "Beautiful, interactive data visualizations for spending insights",
        "Secure user authentication with industry-standard practices",
        "Offline support with automatic sync when connection restored"
      ],
      "technologies": [
        "React",
        "TypeScript",
        "Firebase",
        "Firestore",
        "Tailwind CSS",
        "Recharts",
        "Framer Motion",
        "PWA"
      ],
      "links": {
        "live": null,
        "github": "https://github.com/arshad-shah/expense-frontend",
        "case_study": null
      },
      "featured": false,
      "year": 2023
    }
  ]
}